<template>
  <div class="__PrivacyAgreement-v-root">
    <div class="__PrivacyAgreement-v-label">
      Нажимая на кнопку "{{$props.for}}", я даю свое согласие на обработку моих персональных данных.
      <button type="button" class="primary--text" @click="more = !more">[?]</button>
    </div>
    <v-checkbox
      class="__PrivacyAgreement-v-checkbox"
      v-model="model"
      color="success"
      hide-details
    />
    <small v-if="more" class="__PrivacyAgreement-more">
Настоящим в соответствии с Федеральным законом № 152-ФЗ «О персональных данных» от 27.07.2006 года свободно, своей волей и в своем интересе выражаю свое безусловное согласие на обработку моих персональных данных «ИП Романовская Ю. А.»<!--, зарегистрированным в соответствии с законодательством РФ по адресу:--> (далее по тексту - Оператор).
Персональные данные - любая информация, относящаяся к определенному или определяемому на основании такой информации физическому лицу.
Настоящее Согласие выдано мною на обработку следующих персональных данных:
&#9;-&#9;Имя;
&#9;-&#9;Фамилия;
&#9;-&#9;Телефон;
&#9;-&#9;E-mail.

Согласие дано Оператору для совершения следующих действий с моими персональными данными с использованием средств автоматизации и/или без использования таких средств: сбор, систематизация, накопление, хранение, уточнение (обновление, изменение), использование, обезличивание, а также осуществление любых иных действий, предусмотренных действующим законодательством РФ как неавтоматизированными, так и автоматизированными способами.
Данное согласие дается Оператору для обработки моих персональных данных в следующих целях:
&#9;-&#9;предоставление мне услуг/работ;
&#9;-&#9;направление в мой адрес уведомлений, касающихся предоставляемых услуг/работ;
&#9;-&#9;подготовка и направление ответов на мои запросы;
&#9;-&#9;направление в мой адрес информации, в том числе рекламной, о мероприятиях/товарах/услугах/работах Оператора.

Настоящее согласие действует до момента его отзыва путем направления соответствующего уведомления на электронный адрес magbaget@gmail.com. В случае отзыва мною согласия на обработку персональных данных Оператор вправе продолжить обработку персональных данных без моего согласия при наличии оснований, указанных в пунктах 2 – 11 части 1 статьи 6, части 2 статьи 10 и части 2 статьи 11 Федерального закона №152-ФЗ «О персональных данных» от 27.06.2006 г.
    </small>
  </div>
</template>

<script>
  import vmodel from '@/vmodel'
  export default {
    mixins: [vmodel],
    props: ['for'],
    data() { return { more: false } }
  }
</script>

<style>
  .__PrivacyAgreement-v-root {
    position: relative;
    display: block;
    margin: 1rem 0;
  }

  .__PrivacyAgreement-v-checkbox,
  .__PrivacyAgreement-v-checkbox > * {
    display: inline-block !important;
    width: unset !important;
  }

  .__PrivacyAgreement-v-checkbox {
    position: absolute;
    top: -5px;
  }

  .__PrivacyAgreement-v-label {
    margin-left: 26px;
  }

  .__PrivacyAgreement-more {
    display: inline-block;
    padding-top: 1rem;
    text-align: justify;
    white-space: pre-wrap;
  }
</style>

